// Assignment Operators 
let x = 10;
let y = 5;

// সমর্পণ (Assignment) অপারেটর
x = y; // x এর মান হবে y এর মান (x এর আগের মান হারাবে)
console.log(x); // 5

// যোগ সমর্পণ
x += y; // x এর মানে y যোগ করা হবে (x = x + y)
console.log(x); // 10 + 5 = 15

// বিয়োগ সমর্পণ
x -= y; // x এর মান থেকে y বিয়োগ করা হবে (x = x - y)
console.log(x); // 15 - 5 = 10

// গুণ সমর্পণ
x *= y; // x এর মানে y দ্বারা গুণ করা হবে (x = x * y)
console.log(x); // 10 * 5 = 50

// ভাগ সমর্পণ
x /= y; // x এর মান থেকে y দ্বারা ভাগ করা হবে (x = x / y)
console.log(x); // 50 / 5 = 10

// মডুলাস সমর্পণ
x %= y; // x এর মানটি y দ্বারা ভাগ করলে যে ভাগশেষ থাকবে সেটি x হবে (x = x % y)
console.log(x); // 10 % 5 = 0
