/* 
	==: সমানতা চেক করতে ব্যবহৃত হয়, টাইপ চেক করা হয় না।
	===: সমানতা চেক করতে ব্যবহৃত হয়, এবং টাইপ চেক করা হয়।
	!=: সমান নয় চেক করতে ব্যবহৃত হয়, টাইপ চেক করা হয় না।
   !==: সমান নয় চেক করতে ব্যবহৃত হয়, এবং টাইপ চেক করা হয়।
	>: বৃদ্ধি চেক করতে ব্যবহৃত হয়।
	<: কমি চেক করতে ব্যবহৃত হয়।
	<=: কমি বা সমান চেক করতে ব্যবহৃত হয়।


*/
// Comparison
// == 
let a=12
let b="12"
let c=30
console.log(a==b) // true

console.log(a===b)//false
console.log(a!=b)// false
console.log(a!==b)// true
console.log(a>c)
console.log(a<c)