/* জাভাস্কিপ্ট Asynchronous Programming কি ?
জাভাস্ক্রিপ্ট এসিঙ্ক্রোনাস প্রোগ্রামিং (JavaScript Asynchronous Programming) হলো জাভাস্ক্রিপ্ট প্রোগ্রামিং প্যারাডাইম যেখানে কোড একটি ইভেন্ট বা অপারেশনের সাথে অপারেট করে, কিন্তু সবকিছু ব্লক না করে অন্য কাজ করে 



জাভাস্কিপ্ট synchronous Programming কি ?


জাভাস্ক্রিপ্ট সিঙ্ক্রোনাস প্রোগ্রামিং (JavaScript Synchronous Programming) হলো এমন একটি প্রোগ্রামিং প্যারাডাইম যেখানে কোড একটি অপারেশনের সাথে সিঙ্ক হয় এবং অপারেশন শেষ হওয়া পর্যন্ত সব অন্য কাজ বন্ধ থাকে। অর্থাৎ, এই প্রোগ্রামিং প্যারাডাইমে একটি অপারেশনের নির্দিষ্ট সময় অপেক্ষা করা হয়, এবং অপারেশন সম্পর্কে একটি সিঙ্ক্রোনাস কন্ট্রোল ফ্লো থাকে।
*/